unit uNotes;
interface

implementation

end.

{
мысли

  * Где я? (10, 10 опт)
        Совсем немного времени прошло с момента пробуждения в этом ужасном месте.
        Пугающе и нелепо, что я соврешенно ничего не помню о себе!
        Эта Башня, странная записка, тесные этажи забитые монстрами, какой-то нелепый Темный Мастер...
        Это совершенно сбивает с толку... И еще эта головная боль.
        Однако, не смотря на все эти беды, есть и приятные мелочи.
        Как оказалось, я неплохо владею холодным оружием! Отбиться от монстра было не слишком сложно.
        Этот тонкий изящный кинжал очень удобно и привычно лежит в руке, словно я пользуюсь им уже не первый год...
        Так много вопросов!

      * Этот странный кинжал (50, 20 опт)
            Я четко помню, как кинжал словно из воздуха возник в руке, когда монстр напал на меня.
            Он практический белый и настолько легкий, что вес почти не ощущается. А если хорошо приглядеться,
            можно заметить, что его очертания слегка вибрируют, словно от сделан не из
            металла, как ощущают это рука, а из до крайности плотного тумана или пара...
            Схожу ли я с ума и все что меня окружает лишь плод моего воображения?

          * Верное оружие (100, 30 опт, +5 атк)
                Странное дело. Кинжал словно живой. Когда я спокоен, он словно плотный туман
                с нечеткими очертаниями. Но в момент опасности он превращается в настоящую сталь.
                Острую, смертоносную. Немного потренировавшись, я научился концентрироваться в бою
                и это сделало мое оружие еще более опасным.

          * Иллюзия? (50, 30 опт)
                Оглядываясь вокруг я вижу вполне реальные вещи. Стены, хлам, факела, чудовища всех форм и расцветок.
                Положение мое ужасно, но явных признаков морока не заметно. С другой стороны,
                разве спящий человек не считает все происходящее вокруг реальным и логичным,
                не сморя на всю дикость окружения? Распознать обман можно лишь вглядываясь в мелочи.

  * Кто я? (20, 10 опт)
        Никаких намеков на прошлое. Ни имени, ни воспоминаний, ни целей.
        Словно я возник тут мгновение назад безо всякой цели.
        От этой полной неизвестности накатывает паника.

      * Спокойствие! (300, 50 опт, 2000 автодействий)
            Вдох... Выдох... Вдох... Выдох...
            Разум постепенно успокаивается и появляется ясность. Для принятия решений
            нужно соблюдать спокойствие и сосредоточенность. Какой бы ни была текущая
            ситуация, только взешенные решения и внимательность смогут ее прояснить.
            Я ощущаю силу и решительность...
            Руки непроизвольно выполняют странные движения, похожие на какую-то гимнастику или боевое искусство.
            Похоже, избавившись от контроля разума, тело вспоминает заложенные в него боевые навыки...

          * Старые навыки (500, 100 опт, +5 атк, +5 защ, 3000 автодействий)
                Продолжив эти странные движения и полностью отпустив тело, я ощутил, что
                реально владею неким боевым искусством. С каждой минутой тело действовало все увереннее,
                а разум восстанавливал логику этого мастерства.
                Нет ничего больше придающего уверенности в себе, чем ощущение силы!

              * Забытое искусство боя (2000, 200 опт, +10 атк, +10 защ, 5000 автодействий)
                    Проведя еще несколько часов в тренировках, мне удалось значительно увеличить свои силы.
                    Думаю, если продолжить регулярные бои, умение окончательно восстановится.

              * Искусство обучаемости (2000, 200 опт, открывает навык: +1 к получаемому опыту)
                    Тренировка неожиданно открыла какой-то новый уровень сознания.
                    Теперь я гораздо лучше воспринимаю получаемый опыт, что несомненно позволит
                    стать гораздо сильнее.

              * Искусство восстановления сил (2000, 200 опт, открывает навык: +10 автодействий после убийства монстра)
                    Искусство точных и экономичных движений в бою позволит мне не только не устовать в бою,
                    но и восстанавливать силы.

      * Потеря памяти (50, 20 опт)
            Автор записки упомянул, что потеря памяти - осознанный шаг. Но чей?
            Не был ли я заложником этого "друга"? Или пошел на это добровольно?
            Намек, на то, что это обратимо очень обнадеживает. Однако, совершенно
            не понятно зачем это нужно было сделать.
            При мысли об этом перед глазами почему-то возникает образ разлетающихся
            радужных кристаллов...

          * В чем смысл потери памяти? (100, 30 опт)
                На мой взгляд, причин может быть огромное количество, но можно ли выделить
                несколько наиболее вероятных?
                В первую очередь, это может быть результат серьезной травмы! Кто знает
                что этот "друг" сделал со мной или способствовал чему-то ужасному в отношении меня!
                Так, что еще?
                В записке говорится о поиске некоего Пути. Возможно, воспоминания
                могут этому как-то помешать? Или, наоборот, помочь?
                Там что-то говорилось про мелочи...

              * Ответы в мелочах? (300, 50 опт, 3000 автодействий)
                    Что это значит? Если сложить это с фактом беспамятства, получается,
                    что смысл именно в том, чтобы подробно изучить этот мир. Снова.
                    Или... Или чтобы скрыть факт того, что я знаком с этим миром.
                    От кого скрыть? Какая опасность мне грозит?
                    Похоже, на эти вопросы сейчас ответа мне не найти...

  * Записка (30, 10 опт)
          "Тут золото и кое-какие вещи. Это на первое время. Больше ничем помочь не могу.
           Знаю, что сейчас ты сбит с толку и ничего не помнишь, но это было необходимо
           сделать. Позднее сам все поймешь. Запомни главное - все ответы кроются в мелочах!
           И что бы не происходило в Башне, помни: нужно найти истинный Путь! Удачи, мой друг!"

        В который раз перечитываю это послание. Кто бы ни был ее автор, называющий
        себя другом, он ничего не прояснил в моем нынешнем положении. Ровный и четкий почерк
        говорит о том, что записка писалась в спокойной обстановке и, значит, ее текст
        был хорошо продуман. Что же можно понять из нее?

      * Подлинный Путь? (50, 10 опт)
            Не знаю, что за Истинный Путь имеется ввиду в этой записке. Все, что я вижу
            - просто тесная башня с лесницей уходящей через этажи куда-то вверх.
            Или имеется ввиду, что это лишь видимый путь, не имеющий цели?

      * Предметы (50, 10 опт)
            Те вещи, что лежали в мешке с золотом, больше напоминают детский парфюмерный набор.
            Какие-то бутыльки разных цветов и форм, бумажки... Наверняка, у каждого из них
            есть свое назначение. Может стоит рискнуть и попробовать на вкус содержимое, ну скажем,
            вот этой странной бутылочки?...

          * "Парфюмерный набор"!? (100, 30 опт)
                Эти слова, так невзначай проскользнувшие в мыслях, больно резанули
                сознание своей чужеродностью, мгновенно вспыхнув головной болью.
                Каждая попытка понять откуда эти слова расцветает новой вспышкой боли...

              * Вспомнить через боль... (500, 100 опт, 1 осколок)
                    Пройдя эту долину адской боли, я так и не вспомнил откуда знаю эти слова.
                    Но случилось очередное чудо этого мира. В момент, когда я на миг
                    потерял сознание и уже окончательно не понимал где нахожусь, боль
                    внезакно отступила и я пришел в себя, держа в руках небольшой кристалл или осколок стекла,
                    переливающийся всеми цветами радуги. Я уже не знаю что думать обо всем этом...

      * Башня (50, 10 опт)
            Очнулся я в темном подвале, заваленном хламом. Единственный выход -
            лестница на следующий этаж, где так же монстры и лестница еще выше...
            Какова высота этой башни? Есть ли из нее выход? Что случится, когда я
            доберусь до самого верхнего уровня?
            Вопросы без ответов.

          * Этажи (150, 40 опт)
                Все эти уровни совершенно одинаковые. Темные, захламленные, кишащие монстрами выскакивающими из темноты.
                Все отличие - чем выше, тем больше хлама и монстров. Но должен же быть этому предел!?
                Возможно, не стоит бежать к очередной лестнице прорубаясь через заслон из разъяренного мяса, а
                постараться оглядеться?

              * Такой ли уж это и хлам? (500, 50 опт, открывает режим Этажи)
                    Можно подумать, что это какой-то заброшенный замок или склад.
                    В грудах мусора похоронена вполне изящная мебель, вазы, сундуки и ларцы...
                    Все это выглядело очень обнадеживающе. С некоторым трудом открыв ближайший
                    шкафчик я с радостью обнаружил несколько разноцветных бутылочек, которые,
                    несомненно пригодятся! Но в тот же миг выскочила потревоженная мной огромная крыса
                    и цапнула меня! Не смертельно, но очень болезненно. Впредь стоит быть осторожным...

  * Монстры (100, 25 опт)
        Монстры, как показала практика, не только отличный источник адреналина, но и трофеев.
        После исчезновения туши самых слабых на полу можно найти несколько монет. Но если
        зверюга серьезная - после нее останется какой-нибудь мусор и, возможно, полезный предмет.
        Но чего у них не тайти, так это признаков разума!
        Они просто набрасываются на меня, как только заметят, потрясая воздух рыком и разбрызгивая слюну.

      * Сильные монстры (150, 35 опт)
            Однако, я заметил закономерность. Выход на следующий этаж охраняют более
            сильные монстры. С ними трудно справиться, но и вещи посли них остаются более полезные.
            Не исключено, что сильный монстр является признаком того, что где-то поблизости
            есть что-то интересное...


  * Бессмертие? (30, 10 опт, открывается после первой смерти)
        До сих пор не понимаю что произошло. Очередной монстр оказался сильнее меня и в последний миг,
        видя приближающуюся когтистую лапу я уже подумал, что мой путь по этой башне завершен.
        Далее темнота. Сколько прошло времени? В этой проклятой башне время теряет свой смысл.
        Но вот я открываю глаза и понимаю, что снова оказался в подвале. Совершенно здоровый и растеряный.
        К счастью, то, что я могу считать своей памятью, не утеряно. Я помню, как очнулся здесь
        впервый раз.
        Возможно, раны не были фатальными, а оказался я здесь просто по неизвестным законам этой башни?
        А если я реально погиб, где гарантия, что в следующий раз "воскрешение" случится?
        Это какой-то кошмар наяву! Мне нет выхода из этой башни. Даже смерть бессильна перед ее магией.

  * Золото (100, 30 опт) (открывается при первом использовании, эффект получения предмета блокирован)
        На первый взгляд, это обычные тяжелые крупные монеты из золота или чего-то
        очень его напоминающего. Зачем они? С кем мне тут торговать?
        Кроме безмозглых монстров я пока никого не видел. Но, я заметил, что
        если взять в горсть побольше момент, они начинают вибрировать, словно включается
        какая-то магия.

      * Магия золота? (500, 40 опт, открывается возможность получать случайный предмет за золото)
            Я был прав! Не могу это объяснить, но если сложить вместе определенное количество монет,
            происходит нечто невообразимое - они превращаются в различные предметы!
            Значит, в этом месте существует что-то похожее на магию. И, возможно, любой предмет может быть
            наделен ею...

          * Управление обращением золота? (1500, 100 опт, получение 2 случайных предметов за золото)
                Я невероятно горжусь своей сообразительностью! Мысль о том, что правильно сложенные
                монеты при обращении могут давать различные эффекты подтвердилась.
                Опытным путем я выяснил, что если сложить их не стопкой, а пирамидой,
                при обращении появляется целых 2 предмета!


  * Странный радужный кристалл (500, 40 опт, открывается на использование кристалла)
        Когда я сломал этот радужный кристалл, его пыль словно сталь к магниту, прилипла к коже и
        постепенно рассторилась в ней. А образы, которые плавали в его глубине, подобно яркой вспышке
        возникли в моем сознании и тут же померкли. Но то что я разглядел в этой вспышке,
        взволновало до глубины души: это часть моих воспоминаний!
        Ничтожно малая. Какие-то смутные лица, звуки, обравки слов, но это, несомненно, мои воспоминания!
        Жадно наслаждался я этими крупицами своей памяти. Я не вспомнил ничего конкретного, но
        и этого уже не мало! Мне нужно найти еще этих кристаллов!

  * Темный Мастер? Серьезно? (100, 20 опт, открывается при первой встрече)
        Кто это был? Неужели тот самый Темный Мастер? Невероятно сильный противник!
        Это ощущается не только в силе атак, но и где-то в самой глубине разума.
        Один его вид внушает необъяснимый ужас и чувство бессилия...
        Надеюсь, в будущем удастся избежать встеч с ним. Не представляю как можно было бы его победить...

  * Адский Пес (100, 20 опт, открывается при первой встрече)
        Эта огромная псина заперла меня в подвале как реальную крысу! Нельзя отчаиваться!
        Нужно искать выход. Обыскать весь этаж, попытаться найти решение чтобы ее как-то
        обойти или победить!

  * Бесенок? (100, 20 опт, открывается при первой встрече)
  * Портал монстров (1000, 100 опт, после расчистки этажа и появления портала)





  сюжет
    саписки в башне сделал сам ГГ, который решился на эксперимент, пытаясь
    прорвать магический барьер. это было необходимо, чтобы Темный Мастер не
    смог его засеч и помешать. свои воспоминания перед экспериментом ГГ заключил
    в радужные осколки и рассеял по этажам башни. используя эти околки игрок поднимает
    сознательность и открывает все новые мысли-воспоминания, что дает ему подсказки
    в расшифровке дневника.
    Темный Мастер - одна из эпостасей ГГ, которая блокирует проход чужаков по Башне.
    Этих эпостасей много и каждая занята своими задачами. Они практически
    полностью самостоятельны однако на глубинном уровне связаны воедино и чувстивуют друг-друга.
    потеря памяти ГГ посзолила разрушить эту связь с остальными эпостасями и стать "невидимым"
    шпионом в Башне.
    Башня - однонаправленная структура, ведущая к главной цели. Все эпостаси ГГ
    пытаются не допустить никого к этой цели. Каждая по-своему. Поскольку, это
    подсознательные сущности ГГ, лежащего в коме. И в таком состоянии им очень комфортно.
    По сути, ГГ - основная личность, которая по Башне (нервам позвоночника) пытается
    добраться до вершины(мозга) и вернуть сознание.
    По пути наверх, будут встречаться ответвления в виде небольших "миров" не похожих
    друг на друга. Каждый из них основан на одном из ключевых воспоминаний ГГ.
    И в каждом мире есть темная эпостась, которая пытается его разрушить.
    Победив ее и очистив мир, ГГ получает массу воспоминганий и бОльшую силу, что позволяет
    подниматься все выше к главной цели - победить в финале Темного Мастера башни и вернуться
    в сознание.
    Игра заканчивается сценой выхода из комы.

    Дневник - законы внутреннего подсознательного мира.
    Радужные осколки - части сознания и реальные воспоминания.
    Темный мастер - самая сильная подсознательная личность
    ГГ - основне сознание
    Миры - фантазии на основе реальных воспоминаний
    Барьеры в Башне - переломы позвоночника


   БОЕВКА в башне

   Элементы окна:
      - имя монстра
      - картинка монстра
      - параметры монстра
      - способности монстра
      - способности игрока
      - бонусы

--- Имя монстра ---
   Генерится случайно на текущем выбранном языке

--- Картинка монстра ---
   Выбирается случайно для рядовых монстров и конкретная для уникальных.
   Кликабельна. Клик по ней - обычная атака.
   Автоатака так же считается обычной атакой.

--- Параметры монстра ---
   Здоровье
       простое количество хитов. если нулевое, монстр побежден и игрок получает лут и опыт.
   Мана
       используется для активации заряженых способностей (и скилов игроком)
   Атака
       базовый физический урон. при атаке для вычисления повреждений берется рандом от 0 до значения атаки.
       может быть отрицательным, что начинает лечить противника
   Защита
       базовая физическая защита. каждая единица = 0.1% снижения входящего урона. может быть отрицательным
   Магзащита
       базовая магическая/энергетическая защита. каждая единица = 0.1% снижения силы эффекта.
       может быть отрицательным, что увеличивает эффект воздействия.
       магическими считаются почти все способности.
       и да, сопротивлении магии влияет и на положительные эффекты. например, на лечение
   Реген
       количество перекачки за тик. например, при регенерации здоровья из пула регена.
       дополнительно для монстра - количество единиц получаемого заряда на его способности

--- Способности монстра ---
   работают подобно способностям игрока, но все являются автоматически срабатывающими или пассивными.
   после каждой атаки монстра, согласно регену, по ним случайно распределяются заряды. требуемые типы не имеют значения.
   (как вариант: берутся из присутствующих на данный момент бонусов и тип имеет значение. но это сложно. нужен типа интеллект выбора)
   могут быть целью способностей и эффектов игрока: например блокировка, снятие зарядов и т.п.

--- Способности игрока ---
   В зависимости от уровня навыка Боя, имеется некоторое количество слотов под способности в бою.
   Состав способностей выбирается прямо в бою "на горячую": игрок кликает по слоту и выбирает способность из доступных.
   Она появляется в слоте без зарядов (замещает, если слот не был пустым). Данная смена считается действием.
   Заряд получается климом на одном из присутствующем в бою бонусе. Кадый бонус имеет определенный тип.
   Для зарядки способности требуется набрать определенное количество зарядов определенных типов.
   Очередность набора зарядов должна соблюдаться.
   Например, есть способность с зарядами: A B c c a, где A и B - уже заряженные элементы
   Чтобы продолжить зарядку, требуется дождаться и кликнуть по бонусу типа С.
   Если при взятии бонуса его тип требуется для зарядки несколькими способностями - заряжается каждая.
   После зарядки, способность может быть активирована, если может быть уплачена стоимость активации в мане.
   Типы активации:
       автоматическая - срабатывает в момент зарядки (достаточно заряда и маны)
       активируемая - кликом игрока, если достаточно заряда и маны
       триггер - срабатывает по условию, если достаточно заряда и маны
   Тип оплаты эффекта:
       разряд - списывается мана и весь заряд для активации. после чего начинается перезарядка. расходный эффект
       заряд - заряд остается и списывается только мана.
               по сути, разовый особо сильный эффект-ульта (если не будет внешнего эффекта снятия заряда)
   Тип работы:
       мгновенный - разовый эффект
       постоянный - действует, пока есть заряд (мана требуется только на активацию)
       временный - действует определенное количество времени
   Тип эффекта:
       статичный - зависит от текущей ситуации в момент срабатывания (уровня способности, внешнего фактора).
                   например, сила хила зависит от уровня способности и наложенных эффектов усиления прироста здоровья
       динамичный - в каждый момент времени, пока существует, может варьировать эффект, в зависимости от внешних условий.
                   например, сила бафа защиты сильнее, если здоровье снижается.

   эффекты могут быть совершенно разнообразными и комплексными.
   например: огненный шар по игроку и замена этой способности на другую (эволюция)

=== КЛЮЧЕВЫЕ МЕТОДЫ, ПОРОЖДАЮЩИЕ СОБЫТИЯ =====
[PlayerAttack] - взаимная атака игрока и монтра в башне
[ProcessAuto] - запуск автоматических событий по таймеру
[ProcessState] - проверка состояния игры и изменение

=== АЛГОРИТМ БОЯ =====
--- начало боя --
   ВХОДИМ НА УРОВЕНЬ
     инициализируются и переменные
     fl_FLOOR, fl_STEP

     вызываются событие входа
     (!) onFloorEnter
     сдесь отыгрываются скрипты, например, этажных построек с возможностью переместиться
     на другой этаж

   ПРИМЕНЕНИЕ ПАРАМЕТРОВ ЭТАЖА
     значение переменных fl_ХХХ принимаются в работу

   ГЕНЕРИТСЯ МОНСТР
     (!) onMonsterCreate
         согласно правилам:
         - рядовой, если не последний шаг
         - минибосс, если последний шаг
         - босс уровня, если активирован портал и минибосс побежден, а босс уровня еще не создан.
           его фишка в том, что он сохраняет свое состояние на момент окончания боя.
           но во время боя он получает опыт и может левелапаться, что делает бой еще
           сложнее, если не получилось с первого раза

     перед событием обновляются переменные с параметрами монстра, которые он получит
     после отыгрыша onMonsterCreate:
     mc_IMG, mc_NAME, mc_HP, mc_MP, mc_ATK, mc_DEF, mc_MDEF, mc_REG,
     mc_SKL1, mc_SKL2, mc_SKL3, mc_SKL4, mc_SKL5, mc_SKL6,
     mc_SKL1_lvl, mc_SKL2_lvl, mc_SKL3_lvl, mc_SKL4_lvl, mc_SKL5_lvl, mc_SKL6_lvl,
     mc_SKL1_chrg, mc_SKL2_chrg, mc_SKL3_chrg, mc_SKL4_chrg, mc_SKL5_chrg, mc_SKL6_chrg,

   ЗАПОНЯЕТСЯ ССЫЛКА НА МОНСТРА, С КОТОРЫМ БУДЕМ БИТЬСЯ
     текущими значениями переменных mc_ХХХ генерится монстр

   СОБЫТИЕ НАЧАЛО БОЯ
   (!) onFightBegin

   СОБЫТИЕ НАЧАЛО АТАКИ
   (!) onBeforeAction
     mc_DMG, - выкинутый монстром урон
     mc_BLC, - вычисленная величина блока урона от игрока
     mc_GMS, - количество полученных монстром кристаллов
     pl_DMG, - вычисленный урон игрока по монстру
     pl_BLC, - вычисленная величина блока урона от монстра
     gm_RED - количество выпавших из монстра красных кристаллов
     gm_WHT - количество выпавших из монстра белых кристаллов
     gm_BLU - количество выпавших из монстра синих кристаллов
     gm_GRN - количество выпавших из монстра зеленых кристаллов
     gm_PRP - количество выпавших из монстра фиолетовых кристаллов
     gm_YLW - количество выпавших из монстра желтых кристаллов

   ОЖИДАНИЕ ДЕЙСТВИЯ ИГРОКА / АВТОДЕЙСТВИЕ
      при этом он может свободно действовать в других режимах.
      однако, есть паралаельный метод [ProcessAuto], который не считается дейстивем и
      может вызываться в процессе ожидания. На него можно навесить регенерацию, к примеру

      - простая атака.
        вызывается после метода [PlayerAttack]
        возможность модифицировать все данные, инициализированные на
     (!) onPlayerAttack
        после вызова применяется нанесение дамага игроку и монстру

      - использование способности
        вызывается после метода [PlayerUseSkill]
        устанавливаются переменные:
        us_NAME - внутреннее имя использованного скила
        us_LEVEL - уровень использования скила
        us_POWER = 1 - модификатор эффекта
     (!) onPlayerUseSkill
        после отыгрыша события применяется эффект с именем us_NAME,
        уровнем us_LEVEL и модификатором эффективности us_POWER.
        т.е. можно как подменить скилл, так и уровень и усилить или
        ослабить эффект, вплоть до блока при us_POWER = 0

      - использование зелья
        вызывается после метода [PlayerUseItem]
        устанавливаются переменные:
        ui_NAME - внутреннее имя использованного скила
        ui_POWER = 1 - модификатор эффекта
     (!) onPlayerUseItem
        после отыгрыша события применяется эффект предмета с именем ui_NAME
        и модификатором эффективности ui_POWER.
        т.е. можно как подменить предмет, так и усилить или
        ослабить эффект, вплоть до блока при ui_POWER = 0

     - автоматическое действие
        вызывается после метода [ProcessAuto]
     (!) onTick
        не считается действием и не завершает цикл


   ЗАРЯДКА СПОСОБНОСТИ МОНСТРА
       на каждую способность монстра, получающую заряд, вызывается данное событие.
       устанавливаются переменные:
       msc_NAME - внутреннее имя заряжаемого скила
       msc_COUNT - количество получаемого заряда скилом (часть от общего количества mc_GMS)
       msc_MAX - максимальное требуемое количество для полного заряда скила
   (!) onMonsterSkillCharge

   ОТЫГРЫШ СПОСОБНОСТИ МОНСТРА
       для каждой сработавшей способности монстра вызывается это событие
       устанавливаются переменные:
       msu_NAME - внутреннее имя использованного скила
       msu_POWER = 1 - модификатор эффекта
   (!) onMonsterSkillUse
       после события применяется эффект скила со значением силы

   ОТЫГРЫШ ОКОНЧАНИЯ СОБЫТИЯ (цикла боя)
   (!) onAfterAction
       для эффектов, которые должны сработать после любого действия игрока

=== МЕХАНИЗМ СКРИПТОВ ===
--- Структура ---

}




